Tekla Open API Reference for Tekla Structures 2025
Identifier.GetHashCode Method
 Gets the hash number of the identifier.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
The hashed number.
See Also
Reference
Identifier Class
Tekla.Structures Namespace